; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-13)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 )
(:init
(arm-empty)
(on-table b1)
(on b2 b4)
(on-table b3)
(on b4 b8)
(on b5 b6)
(on b6 b13)
(on b7 b5)
(on b8 b7)
(on-table b9)
(on-table b10)
(on b11 b2)
(on b12 b9)
(on b13 b1)
(clear b3)
(clear b10)
(clear b11)
(clear b12)
)
(:goal
(and
(on b1 b2)
(on b2 b12)
(on b3 b6)
(on b4 b10)
(on b6 b1)
(on b8 b4)
(on b9 b11)
(on b10 b7)
(on b11 b13)
(on b12 b8)
(on b13 b5))
)
)

; plan
1. (unstack b11 b2)
   deleted: (on b11 b2) (clear b11) (arm-empty)
   added: (holding b11) (clear b2)
   goals met: 0 of 11
2. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 11
3. (unstack b2 b4)
   deleted: (on b2 b4) (clear b2) (arm-empty)
   added: (holding b2) (clear b4)
   goals met: 0 of 11
4. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 11
5. (unstack b4 b8)
   deleted: (on b4 b8) (clear b4) (arm-empty)
   added: (holding b4) (clear b8)
   goals met: 0 of 11
6. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 11
7. (unstack b8 b7)
   deleted: (on b8 b7) (clear b8) (arm-empty)
   added: (holding b8) (clear b7)
   goals met: 0 of 11
8. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 11
9. (unstack b7 b5)
   deleted: (on b7 b5) (clear b7) (arm-empty)
   added: (holding b7) (clear b5)
   goals met: 0 of 11
10. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 11
11. (unstack b5 b6)
   deleted: (on b5 b6) (clear b5) (arm-empty)
   added: (holding b5) (clear b6)
   goals met: 0 of 11
12. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 11
13. (unstack b6 b13)
   deleted: (on b6 b13) (clear b6) (arm-empty)
   added: (holding b6) (clear b13)
   goals met: 0 of 11
14. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 11
15. (unstack b13 b1)
   deleted: (on b13 b1) (clear b13) (arm-empty)
   added: (holding b13) (clear b1)
   goals met: 0 of 11
16. (stack b13 b5)
   deleted: (clear b5) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b5)
   goals met: 1 of 11
17. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 1 of 11
18. (stack b10 b7)
   deleted: (clear b7) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b7)
   goals met: 2 of 11
19. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 2 of 11
20. (stack b11 b13)
   deleted: (clear b13) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b13)
   goals met: 3 of 11
21. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 3 of 11
22. (stack b4 b10)
   deleted: (clear b10) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b10)
   goals met: 4 of 11
23. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 4 of 11
24. (stack b8 b4)
   deleted: (clear b4) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b4)
   goals met: 5 of 11
25. (unstack b12 b9)
   deleted: (on b12 b9) (clear b12) (arm-empty)
   added: (holding b12) (clear b9)
   goals met: 5 of 11
26. (stack b12 b8)
   deleted: (clear b8) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b8)
   goals met: 6 of 11
27. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 6 of 11
28. (stack b2 b12)
   deleted: (clear b12) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b12)
   goals met: 7 of 11
29. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 7 of 11
30. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 8 of 11
31. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 8 of 11
32. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 9 of 11
33. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 9 of 11
34. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 10 of 11
35. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 10 of 11
36. (stack b9 b11)
   deleted: (clear b11) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b11)
   goals met: 11 of 11
